InformationRegisters/РСК_ЖурналРаботыМониторингаВремениЖизниРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_ЖурналРаботыМониторингаВремениЖизниРезерва</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объекты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_ЖурналРаботыМониторингаВремениЖизниРезерва/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РСК_ЖурналРаботыМониторингаВремениЖизниРезерва.Объекты КАК Объекты
	|ИЗ
	|	РегистрСведений.РСК_ЖурналРаботыМониторингаВремениЖизниРезерва КАК РСК_ЖурналРаботыМониторингаВремениЖизниРезерва
	|ГДЕ
	|	РСК_ЖурналРаботыМониторингаВремениЖизниРезерва.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор",Запись.Идентификатор);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ТаблицаОбработки = ПроизвестиЧтениеТаблицыИзXMLСервер(Результат.Объекты.Получить());
	КонецЦикла;  
	
	Если ТаблицаОбработки.Колонки.Найти("Номенклатура") <> Неопределено Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Резервы;
		ВывестиДеревоРезультата(ТаблицаОбработки)	
	Иначе 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Статусы;
		ВывестиТаблицуРезультата(ТаблицаОбработки)	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ВывестиДеревоРезультата(ТаблицаОбработки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТОбработки",ТаблицаОбработки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТОбработки.Объект КАК Объект,
	|	ТОбработки.Номенклатура КАК Номенклатура,
	|	ТОбработки.НомерСтроки КАК НомерСтроки,
	|	ТОбработки.Характеристика КАК Характеристика,
	|	ТОбработки.Серия КАК Серия,
	|	ТОбработки.Сумма КАК Сумма,
	|	ТОбработки.ВыполненоСОшибками КАК ВыполненоСОшибками
	|ПОМЕСТИТЬ ТАБ_Журнала
	|ИЗ
	|	&ТОбработки КАК ТОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ_Журнала.Объект КАК Объект,
	|	ТАБ_Журнала.Номенклатура КАК Номенклатура,
	|	ТАБ_Журнала.НомерСтроки КАК НомерСтроки,
	|	ТАБ_Журнала.Характеристика КАК Характеристика,
	|	ТАБ_Журнала.Серия КАК Серия,
	|	ТАБ_Журнала.Сумма КАК Сумма,
	|	ТАБ_Журнала.ВыполненоСОшибками КАК ВыполненоСОшибками
	|ИЗ
	|	ТАБ_Журнала КАК ТАБ_Журнала
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Объект";
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВРеквизитФормы(Результат,"ДеревоИзменений");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуРезультата(ТаблицаОбработки)
	ТаблицаСтатусы.Загрузить(ТаблицаОбработки);	
КонецПроцедуры

&НаСервере
Функция ПроизвестиЧтениеТаблицыИзXMLСервер(СтрокаXML)
    
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.УстановитьСтроку(СтрокаXML);
    ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueTable");
    ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,ТипОбъектаXDTO); 
    ОбъектXDTO.Проверить();
    
    ЧтениеXML.Закрыть();
    ТЗ = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
    Возврат ТЗ;
    
КонецФункции
